In [2]:
import numpy as np
import pandas as pd

#### 1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.

In [4]:
arr=[1,2,3,4,5]
arr=pd.Series(arr)
arr

0    1
1    2
2    3
3    4
4    5
dtype: int64

#### 2. Write a Pandas program to convert a Panda module Series to Python list and it's type

In [5]:
arr=arr.to_list()
arr

[1, 2, 3, 4, 5]

#### 3. Write a Pandas program to compare the elements of the two Pandas Series.

In [7]:
arr1=pd.Series(arr)
arr2=pd.Series([5,4,3,2,1])
arr1.equals(arr2)

False

#### 4. Write a Pandas program to change the data type of given a column or a Series.

In [11]:
x=pd.Series(["0","1","3"])
print(x)
x=x.astype(int)
x

0    0
1    1
2    3
dtype: object

0    0
1    1
2    3
dtype: int32

#### 5. Write a Pandas program to get the powers of an array values element-wise.

In [16]:
sample_data={'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
df=pd.DataFrame(sample_data)
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

#### 6. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [15]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data)
df=df[['attempts','name','score','qualify']]
df.head(3)

   attempts       name  score qualify
0         1  Anastasia   12.5     yes
1         3       Dima    9.0      no
2         2  Katherine   16.5     yes

#### 7. Write a Pandas program to display the default index and set a column as an Index in a given dataframe

In [28]:

test_data= {'0':[0,1,2,3,4,5],'1':['Streat1','Streat2','Streat3','Streat4','Streat5','Streat6'],
       '2':['S001','S002','S003','S004','S005','S006'],'3':['V','V','VI','VI','V','VI'],
       '4':['Alberto','Gino', 'Ryan','Eesha', 'Gino','David'],
       '5':['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
       '6':[35,32,33,30,31,32]}
df=pd.DataFrame(test_data)
df = df.set_index('0')
df

         1     2   3        4           5   6
0
0  Streat1  S001   V  Alberto  15/05/2002  35
1  Streat2  S002   V     Gino  17/05/2002  32
2  Streat3  S003  VI     Ryan  16/02/1999  33
3  Streat4  S004  VI    Eesha  25/09/1998  30
4  Streat5  S005   V     Gino  11/05/2002  31
5  Streat6  S006  VI    David  15/09/1997  32

In [29]:
df=df.reset_index()
df

   0        1     2   3        4           5   6
0  0  Streat1  S001   V  Alberto  15/05/2002  35
1  1  Streat2  S002   V     Gino  17/05/2002  32
2  2  Streat3  S003  VI     Ryan  16/02/1999  33
3  3  Streat4  S004  VI    Eesha  25/09/1998  30
4  4  Streat5  S005   V     Gino  11/05/2002  31
5  5  Streat6  S006  VI    David  15/09/1997  32

#### 9. Write a Pandas program to create a dataframe indexing by date and time.

In [31]:
df=df.set_index("5")
df

            0        1     2   3        4   6
5
15/05/2002  0  Streat1  S001   V  Alberto  35
17/05/2002  1  Streat2  S002   V     Gino  32
16/02/1999  2  Streat3  S003  VI     Ryan  33
25/09/1998  3  Streat4  S004  VI    Eesha  30
11/05/2002  4  Streat5  S005   V     Gino  31
15/09/1997  5  Streat6  S006  VI    David  32

#### 10. Write a Pandas program to create a dataframe and set a title or name of the index column.

In [34]:
df=df.rename_axis("real index",axis="index")
df

            0        1     2   3        4   6
real index
15/05/2002  0  Streat1  S001   V  Alberto  35
17/05/2002  1  Streat2  S002   V     Gino  32
16/02/1999  2  Streat3  S003  VI     Ryan  33
25/09/1998  3  Streat4  S004  VI    Eesha  30
11/05/2002  4  Streat5  S005   V     Gino  31
15/09/1997  5  Streat6  S006  VI    David  32

#### 11. Write a Pandas program to select a specific row of given series/dataframe by integer index.

In [36]:
df[df["6"]==35]

            0        1     2  3        4   6
real index
15/05/2002  0  Streat1  S001  V  Alberto  35